Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/edc/PIC32MZ2025DAH176.PIC
      <edc:SFRDef edc:_addr="0x1F801444" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="16" edc:access="----------------------------nnnn" edc:cname="IC4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC4R" edc:desc="" edc:mask="0xf" edc:name="IC4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801448" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="17" edc:access="----------------------------nnnn" edc:cname="IC5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC5R" edc:desc="" edc:mask="0xf" edc:name="IC5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80144C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="18" edc:access="----------------------------nnnn" edc:cname="IC6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC6R" edc:desc="" edc:mask="0xf" edc:name="IC6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801450" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="19" edc:access="----------------------------nnnn" edc:cname="IC7R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC7R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC7R" edc:desc="" edc:mask="0xf" edc:name="IC7R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801454" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="20" edc:access="----------------------------nnnn" edc:cname="IC8R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC8R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC8R" edc:desc="" edc:mask="0xf" edc:name="IC8R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801458" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="21" edc:access="----------------------------nnnn" edc:cname="IC9R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC9R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC9R" edc:desc="" edc:mask="0xf" edc:name="IC9R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80145C" edc:offset="04"/>
      <edc:SFRDef edc:_addr="0x1F801460" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="22" edc:access="----------------------------nnnn" edc:cname="OCFAR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="OCFAR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OCFAR" edc:desc="" edc:mask="0xf" edc:name="OCFAR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801464" edc:offset="04"/>
      <edc:SFRDef edc:_addr="0x1F801468" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="23" edc:access="----------------------------nnnn" edc:cname="U1RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U1RXR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1RXR" edc:desc="" edc:mask="0xf" edc:name="U1RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
