Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/edc/PIC32MZ2025DAH176.PIC
      <edc:SFRDef edc:_addr="0x1F8607D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SRCON1H" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SRCON1H" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1H0" edc:mask="0x1" edc:name="SR1H0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H1" edc:mask="0x1" edc:name="SR1H1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H2" edc:mask="0x1" edc:name="SR1H2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H3" edc:mask="0x1" edc:name="SR1H3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H4" edc:mask="0x1" edc:name="SR1H4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H5" edc:mask="0x1" edc:name="SR1H5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H6" edc:mask="0x1" edc:name="SR1H6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H7" edc:mask="0x1" edc:name="SR1H7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H8" edc:mask="0x1" edc:name="SR1H8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H9" edc:mask="0x1" edc:name="SR1H9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H10" edc:mask="0x1" edc:name="SR1H10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H11" edc:mask="0x1" edc:name="SR1H11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H12" edc:mask="0x1" edc:name="SR1H12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H13" edc:mask="0x1" edc:name="SR1H13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H14" edc:mask="0x1" edc:name="SR1H14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1H15" edc:mask="0x1" edc:name="SR1H15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8607E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F860800" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="-----------------------------n--" edc:cname="ANSELJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffff0004" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------------1--" edc:name="ANSELJ" edc:nzwidth="0x20" edc:por="-----------------------------1--" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSJ2" edc:desc="" edc:mask="0x1" edc:name="ANSJ2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860810" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TRISJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111111111111111" edc:name="TRISJ" edc:nzwidth="0x20" edc:por="----------------1111111111111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISJ0" edc:desc="" edc:mask="0x1" edc:name="TRISJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ1" edc:desc="" edc:mask="0x1" edc:name="TRISJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ2" edc:desc="" edc:mask="0x1" edc:name="TRISJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ3" edc:desc="" edc:mask="0x1" edc:name="TRISJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ4" edc:desc="" edc:mask="0x1" edc:name="TRISJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ5" edc:desc="" edc:mask="0x1" edc:name="TRISJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ6" edc:desc="" edc:mask="0x1" edc:name="TRISJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ7" edc:desc="" edc:mask="0x1" edc:name="TRISJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ8" edc:desc="" edc:mask="0x1" edc:name="TRISJ8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISJ9" edc:desc="" edc:mask="0x1" edc:name="TRISJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ10" edc:desc="" edc:mask="0x1" edc:name="TRISJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ11" edc:desc="" edc:mask="0x1" edc:name="TRISJ11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISJ12" edc:desc="" edc:mask="0x1" edc:name="TRISJ12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISJ13" edc:desc="" edc:mask="0x1" edc:name="TRISJ13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISJ14" edc:desc="" edc:mask="0x1" edc:name="TRISJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ15" edc:desc="" edc:mask="0x1" edc:name="TRISJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860820" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PORTJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PORTJ" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RJ0" edc:desc="" edc:mask="0x1" edc:name="RJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ1" edc:desc="" edc:mask="0x1" edc:name="RJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ2" edc:desc="" edc:mask="0x1" edc:name="RJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ3" edc:desc="" edc:mask="0x1" edc:name="RJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ4" edc:desc="" edc:mask="0x1" edc:name="RJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ5" edc:desc="" edc:mask="0x1" edc:name="RJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ6" edc:desc="" edc:mask="0x1" edc:name="RJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ7" edc:desc="" edc:mask="0x1" edc:name="RJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ8" edc:desc="" edc:mask="0x1" edc:name="RJ8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RJ9" edc:desc="" edc:mask="0x1" edc:name="RJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ10" edc:desc="" edc:mask="0x1" edc:name="RJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ11" edc:desc="" edc:mask="0x1" edc:name="RJ11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RJ12" edc:desc="" edc:mask="0x1" edc:name="RJ12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RJ13" edc:desc="" edc:mask="0x1" edc:name="RJ13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RJ14" edc:desc="" edc:mask="0x1" edc:name="RJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ15" edc:desc="" edc:mask="0x1" edc:name="RJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860830" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="LATJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="LATJ" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATJ0" edc:desc="" edc:mask="0x1" edc:name="LATJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ1" edc:desc="" edc:mask="0x1" edc:name="LATJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ2" edc:desc="" edc:mask="0x1" edc:name="LATJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ3" edc:desc="" edc:mask="0x1" edc:name="LATJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ4" edc:desc="" edc:mask="0x1" edc:name="LATJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ5" edc:desc="" edc:mask="0x1" edc:name="LATJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ6" edc:desc="" edc:mask="0x1" edc:name="LATJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ7" edc:desc="" edc:mask="0x1" edc:name="LATJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ8" edc:desc="" edc:mask="0x1" edc:name="LATJ8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATJ9" edc:desc="" edc:mask="0x1" edc:name="LATJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ10" edc:desc="" edc:mask="0x1" edc:name="LATJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ11" edc:desc="" edc:mask="0x1" edc:name="LATJ11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATJ12" edc:desc="" edc:mask="0x1" edc:name="LATJ12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATJ13" edc:desc="" edc:mask="0x1" edc:name="LATJ13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATJ14" edc:desc="" edc:mask="0x1" edc:name="LATJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ15" edc:desc="" edc:mask="0x1" edc:name="LATJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860840" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ODCJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ODCJ" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCJ0" edc:desc="" edc:mask="0x1" edc:name="ODCJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ1" edc:desc="" edc:mask="0x1" edc:name="ODCJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ2" edc:desc="" edc:mask="0x1" edc:name="ODCJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ3" edc:desc="" edc:mask="0x1" edc:name="ODCJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ4" edc:desc="" edc:mask="0x1" edc:name="ODCJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ5" edc:desc="" edc:mask="0x1" edc:name="ODCJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ6" edc:desc="" edc:mask="0x1" edc:name="ODCJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ7" edc:desc="" edc:mask="0x1" edc:name="ODCJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ8" edc:desc="" edc:mask="0x1" edc:name="ODCJ8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCJ9" edc:desc="" edc:mask="0x1" edc:name="ODCJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ10" edc:desc="" edc:mask="0x1" edc:name="ODCJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ11" edc:desc="" edc:mask="0x1" edc:name="ODCJ11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCJ12" edc:desc="" edc:mask="0x1" edc:name="ODCJ12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCJ13" edc:desc="" edc:mask="0x1" edc:name="ODCJ13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCJ14" edc:desc="" edc:mask="0x1" edc:name="ODCJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ15" edc:desc="" edc:mask="0x1" edc:name="ODCJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
