Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/edc/PIC32MZ2025DAH176.PIC
      <edc:SFRDef edc:_addr="0x1F8E501C" edc:_begin="0x0" edc:_end="0x28" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CEPOLLCON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CEPOLLCON" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BDPPLCON" edc:desc="" edc:mask="0xffff" edc:name="BDPPLCON" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E5020" edc:_begin="0x0" edc:_end="0x28" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="CEHDLEN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CEHDLEN" edc:nzwidth="32" edc:por="------------------------00000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HDRLEN" edc:desc="" edc:mask="0xff" edc:name="HDRLEN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E5024" edc:_begin="0x0" edc:_end="0x28" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="CETRLLEN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CETRLLEN" edc:nzwidth="32" edc:por="------------------------00000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRLRLEN" edc:desc="" edc:mask="0xff" edc:name="TRLRLEN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E5028" edc:offset="4056"/>
      <edc:SFRDef edc:_addr="0x1F8E6000" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGVER" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGVER" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:baseofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="" edc:mask="0x7f" edc:name="REVISION" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="VERSION" edc:desc="" edc:mask="0x1ff" edc:name="VERSION" edc:nzwidth="9"/>
            <edc:SFRFieldDef edc:cname="ID" edc:desc="" edc:mask="0xffff" edc:name="ID" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6004" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="-------------------n-nnnnnnnnnnn" edc:cname="RNGCON" edc:desc="" edc:impl="0x17ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0-00001000000" edc:name="RNGCON" edc:nzwidth="32" edc:por="-------------------0-00001000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0xff" edc:name="PLEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="TRNGEN" edc:desc="" edc:mask="0x1" edc:name="TRNGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PRNGEN" edc:desc="" edc:mask="0x1" edc:name="PRNGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CONT" edc:desc="" edc:mask="0x1" edc:name="CONT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRNGMODE" edc:desc="" edc:mask="0x1" edc:name="TRNGMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LOAD" edc:desc="" edc:mask="0x1" edc:name="LOAD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6008" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGPOLY1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111110000000000000000" edc:name="RNGPOLY1" edc:nzwidth="32" edc:por="11111111111111110000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POLY" edc:desc="" edc:mask="0xffffffff" edc:name="POLY" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E600C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGPOLY2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111110000000000000000" edc:name="RNGPOLY2" edc:nzwidth="32" edc:por="11111111111111110000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POLY" edc:desc="" edc:mask="0xffffffff" edc:name="POLY" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6010" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGNUMGEN1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111111111111111111111" edc:name="RNGNUMGEN1" edc:nzwidth="32" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RNG" edc:desc="" edc:mask="0xffffffff" edc:name="RNG" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6014" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGNUMGEN2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111111111111111111111" edc:name="RNGNUMGEN2" edc:nzwidth="32" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RNG" edc:desc="" edc:mask="0xffffffff" edc:name="RNG" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6018" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGSEED1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGSEED1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEED" edc:desc="" edc:mask="0xffffffff" edc:name="SEED" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
