Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/edc/PIC32MZ2025DAH176.PIC
      <edc:SFRDef edc:_addr="0x1F8EA8DC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA55" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA55" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1331" edc:desc="" edc:mask="0xf" edc:name="PIXEL1331" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1330" edc:desc="" edc:mask="0xf" edc:name="PIXEL1330" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1329" edc:desc="" edc:mask="0xf" edc:name="PIXEL1329" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1328" edc:desc="" edc:mask="0xf" edc:name="PIXEL1328" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1327" edc:desc="" edc:mask="0xf" edc:name="PIXEL1327" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1326" edc:desc="" edc:mask="0xf" edc:name="PIXEL1326" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1325" edc:desc="" edc:mask="0xf" edc:name="PIXEL1325" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1324" edc:desc="" edc:mask="0xf" edc:name="PIXEL1324" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8E0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA56" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA56" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL147" edc:desc="" edc:mask="0xf" edc:name="PIXEL147" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL146" edc:desc="" edc:mask="0xf" edc:name="PIXEL146" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL145" edc:desc="" edc:mask="0xf" edc:name="PIXEL145" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL144" edc:desc="" edc:mask="0xf" edc:name="PIXEL144" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL143" edc:desc="" edc:mask="0xf" edc:name="PIXEL143" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL142" edc:desc="" edc:mask="0xf" edc:name="PIXEL142" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL141" edc:desc="" edc:mask="0xf" edc:name="PIXEL141" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL140" edc:desc="" edc:mask="0xf" edc:name="PIXEL140" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8E4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA57" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA57" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1415" edc:desc="" edc:mask="0xf" edc:name="PIXEL1415" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1414" edc:desc="" edc:mask="0xf" edc:name="PIXEL1414" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1413" edc:desc="" edc:mask="0xf" edc:name="PIXEL1413" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1412" edc:desc="" edc:mask="0xf" edc:name="PIXEL1412" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1411" edc:desc="" edc:mask="0xf" edc:name="PIXEL1411" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1410" edc:desc="" edc:mask="0xf" edc:name="PIXEL1410" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL149" edc:desc="" edc:mask="0xf" edc:name="PIXEL149" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL148" edc:desc="" edc:mask="0xf" edc:name="PIXEL148" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8E8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA58" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA58" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1423" edc:desc="" edc:mask="0xf" edc:name="PIXEL1423" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1422" edc:desc="" edc:mask="0xf" edc:name="PIXEL1422" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1421" edc:desc="" edc:mask="0xf" edc:name="PIXEL1421" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1420" edc:desc="" edc:mask="0xf" edc:name="PIXEL1420" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1419" edc:desc="" edc:mask="0xf" edc:name="PIXEL1419" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1418" edc:desc="" edc:mask="0xf" edc:name="PIXEL1418" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1417" edc:desc="" edc:mask="0xf" edc:name="PIXEL1417" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1416" edc:desc="" edc:mask="0xf" edc:name="PIXEL1416" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8EC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA59" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA59" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1431" edc:desc="" edc:mask="0xf" edc:name="PIXEL1431" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1430" edc:desc="" edc:mask="0xf" edc:name="PIXEL1430" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1429" edc:desc="" edc:mask="0xf" edc:name="PIXEL1429" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1428" edc:desc="" edc:mask="0xf" edc:name="PIXEL1428" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1427" edc:desc="" edc:mask="0xf" edc:name="PIXEL1427" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1426" edc:desc="" edc:mask="0xf" edc:name="PIXEL1426" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1425" edc:desc="" edc:mask="0xf" edc:name="PIXEL1425" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1424" edc:desc="" edc:mask="0xf" edc:name="PIXEL1424" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8F0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA60" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA60" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL157" edc:desc="" edc:mask="0xf" edc:name="PIXEL157" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL156" edc:desc="" edc:mask="0xf" edc:name="PIXEL156" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL155" edc:desc="" edc:mask="0xf" edc:name="PIXEL155" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL154" edc:desc="" edc:mask="0xf" edc:name="PIXEL154" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL153" edc:desc="" edc:mask="0xf" edc:name="PIXEL153" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL152" edc:desc="" edc:mask="0xf" edc:name="PIXEL152" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL151" edc:desc="" edc:mask="0xf" edc:name="PIXEL151" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL150" edc:desc="" edc:mask="0xf" edc:name="PIXEL150" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8F4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA61" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA61" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1515" edc:desc="" edc:mask="0xf" edc:name="PIXEL1515" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1514" edc:desc="" edc:mask="0xf" edc:name="PIXEL1514" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1513" edc:desc="" edc:mask="0xf" edc:name="PIXEL1513" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1512" edc:desc="" edc:mask="0xf" edc:name="PIXEL1512" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1511" edc:desc="" edc:mask="0xf" edc:name="PIXEL1511" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1510" edc:desc="" edc:mask="0xf" edc:name="PIXEL1510" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL159" edc:desc="" edc:mask="0xf" edc:name="PIXEL159" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL158" edc:desc="" edc:mask="0xf" edc:name="PIXEL158" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8F8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA62" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA62" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1523" edc:desc="" edc:mask="0xf" edc:name="PIXEL1523" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1522" edc:desc="" edc:mask="0xf" edc:name="PIXEL1522" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1521" edc:desc="" edc:mask="0xf" edc:name="PIXEL1521" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1520" edc:desc="" edc:mask="0xf" edc:name="PIXEL1520" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1519" edc:desc="" edc:mask="0xf" edc:name="PIXEL1519" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1518" edc:desc="" edc:mask="0xf" edc:name="PIXEL1518" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1517" edc:desc="" edc:mask="0xf" edc:name="PIXEL1517" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1516" edc:desc="" edc:mask="0xf" edc:name="PIXEL1516" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8FC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA63" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA63" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1531" edc:desc="" edc:mask="0xf" edc:name="PIXEL1531" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1530" edc:desc="" edc:mask="0xf" edc:name="PIXEL1530" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1529" edc:desc="" edc:mask="0xf" edc:name="PIXEL1529" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1528" edc:desc="" edc:mask="0xf" edc:name="PIXEL1528" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1527" edc:desc="" edc:mask="0xf" edc:name="PIXEL1527" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1526" edc:desc="" edc:mask="0xf" edc:name="PIXEL1526" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1525" edc:desc="" edc:mask="0xf" edc:name="PIXEL1525" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1524" edc:desc="" edc:mask="0xf" edc:name="PIXEL1524" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA900" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA64" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA64" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL167" edc:desc="" edc:mask="0xf" edc:name="PIXEL167" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL166" edc:desc="" edc:mask="0xf" edc:name="PIXEL166" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL165" edc:desc="" edc:mask="0xf" edc:name="PIXEL165" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL164" edc:desc="" edc:mask="0xf" edc:name="PIXEL164" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL163" edc:desc="" edc:mask="0xf" edc:name="PIXEL163" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL162" edc:desc="" edc:mask="0xf" edc:name="PIXEL162" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL161" edc:desc="" edc:mask="0xf" edc:name="PIXEL161" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL160" edc:desc="" edc:mask="0xf" edc:name="PIXEL160" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA904" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA65" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA65" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1615" edc:desc="" edc:mask="0xf" edc:name="PIXEL1615" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1614" edc:desc="" edc:mask="0xf" edc:name="PIXEL1614" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1613" edc:desc="" edc:mask="0xf" edc:name="PIXEL1613" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1612" edc:desc="" edc:mask="0xf" edc:name="PIXEL1612" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1611" edc:desc="" edc:mask="0xf" edc:name="PIXEL1611" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1610" edc:desc="" edc:mask="0xf" edc:name="PIXEL1610" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL169" edc:desc="" edc:mask="0xf" edc:name="PIXEL169" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL168" edc:desc="" edc:mask="0xf" edc:name="PIXEL168" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
